k6-test-main/zeta/kyverno-load-testing/k6/audit-3rep/kyverno-pods-zeta.js-100vu-200it-logs.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: /script/script.js
     output: -

  scenarios: (100.00%) 1 scenario, 100 max VUs, 10m30s max duration (incl. graceful stop):
           * default: 200 iterations shared among 100 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2023-12-21T08:34:35Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:35Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:35Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-21T08:34:36Z" level=info msg="received response 201 201 Created" source=console

running (00m01.0s), 100/100 VUs, 44 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  00m01.0s/10m0s  044/200 shared iters
time="2023-12-21T08:34:36Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:36Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:36Z" level=info msg="received response 201 201 Created" source=console
[...]
time="2023-12-21T08:34:37Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:37Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:37Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m02.0s), 100/100 VUs, 88 complete and 0 interrupted iterations
default   [  44% ] 100 VUs  00m02.0s/10m0s  088/200 shared iters
time="2023-12-21T08:34:37Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:37Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:37Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m03.0s), 073/100 VUs, 127 complete and 0 interrupted iterations
default   [  64% ] 100 VUs  00m03.0s/10m0s  127/200 shared iters
time="2023-12-21T08:34:38Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:38Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:38Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m04.0s), 048/100 VUs, 152 complete and 0 interrupted iterations
default   [  76% ] 100 VUs  00m04.0s/10m0s  152/200 shared iters
time="2023-12-21T08:34:39Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:39Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:39Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m05.0s), 035/100 VUs, 165 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  00m05.0s/10m0s  165/200 shared iters
time="2023-12-21T08:34:40Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:40Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:40Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m06.0s), 024/100 VUs, 176 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  00m06.0s/10m0s  176/200 shared iters
time="2023-12-21T08:34:41Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:41Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:41Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m07.0s), 019/100 VUs, 181 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  00m07.0s/10m0s  181/200 shared iters
time="2023-12-21T08:34:42Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:42Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:42Z" level=info msg="received response 201 201 Created" source=console
[...]

running (00m08.0s), 008/100 VUs, 192 complete and 0 interrupted iterations
default   [  96% ] 100 VUs  00m08.0s/10m0s  192/200 shared iters
time="2023-12-21T08:34:43Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:43Z" level=info msg="received response 201 201 Created" source=console

running (00m09.0s), 006/100 VUs, 194 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  00m09.0s/10m0s  194/200 shared iters

running (00m10.0s), 006/100 VUs, 194 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  00m10.0s/10m0s  194/200 shared iters
time="2023-12-21T08:34:45Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:45Z" level=info msg="received response 201 201 Created" source=console
time="2023-12-21T08:34:45Z" level=info msg="received response 201 201 Created" source=console
[...]

     ✓ verify response code of POST is 201

     █ teardown

     checks.........................: 100.00% ✓ 200       ✗ 0    
     data_received..................: 640 kB  63 kB/s
     data_sent......................: 192 kB  19 kB/s
     http_req_blocked...............: avg=23.81ms  min=182ns   med=9.18ms  max=63.51ms  p(90)=59.58ms  p(95)=60.93ms 
     http_req_connecting............: avg=3.07ms   min=0s      med=38.12µs max=30.15ms  p(90)=2.3ms    p(95)=29.98ms 
     http_req_duration..............: avg=2.31s    min=12.7ms  med=1.33s   max=10.03s   p(90)=6.26s    p(95)=7.26s   
       { expected_response:true }...: avg=2.31s    min=12.7ms  med=1.33s   max=10.03s   p(90)=6.26s    p(95)=7.26s   
     http_req_failed................: 0.00%   ✓ 0         ✗ 200  
     http_req_receiving.............: avg=88.79µs  min=32.96µs med=74.42µs max=560.17µs p(90)=113.7µs  p(95)=133.44µs
     http_req_sending...............: avg=116.65µs min=36.98µs med=82.53µs max=4.95ms   p(90)=142.88µs p(95)=160.58µs
     http_req_tls_handshaking.......: avg=19.43ms  min=0s      med=1.47ms  max=61.43ms  p(90)=56.52ms  p(95)=59.07ms 
     http_req_waiting...............: avg=2.31s    min=12.52ms med=1.33s   max=10.03s   p(90)=6.26s    p(95)=7.26s   
     http_reqs......................: 200     19.542418/s
     iteration_duration.............: avg=2.32s    min=2.06µs  med=1.31s   max=10.07s   p(90)=6.25s    p(95)=7.32s   
     iterations.....................: 200     19.542418/s
     vus............................: 6       min=6       max=100
     vus_max........................: 100     min=100     max=100


running (00m10.2s), 000/100 VUs, 200 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  00m10.2s/10m0s  200/200 shared iters
============== STRIP ==============
{
    "metrics": {
        "iteration_duration": {
            "med": 1316.853066,
            "max": 10074.919636,
            "p(90)": 6259.493877,
            "p(95)": 7329.916947,
            "avg": 2328.190491865672,
            "min": 0.002066
        },
        "vus": {
            "value": 6,
            "min": 6,
            "max": 100
        },
        "vus_max": {
            "value": 100,
            "min": 100,
            "max": 100
        },
        "http_reqs": {
            "count": 200,
            "rate": 19.54241832031052
        },
        "checks": {
            "passes": 200,
            "fails": 0,
            "value": 1
        },
        "iterations": {
            "count": 200,
            "rate": 19.54241832031052
        },
        "http_req_duration": {
            "p(90)": 6262.5935644,
            "p(95)": 7269.28357115,
            "avg": 2314.446891585,
            "min": 12.700249,
            "med": 1333.138746,
            "max": 10036.377609
        },
        "http_req_sending": {
            "avg": 0.11665407999999994,
            "min": 0.036988,
            "med": 0.082531,
            "max": 4.953308,
            "p(90)": 0.1428851,
            "p(95)": 0.16058854999999994
        },
        "http_req_tls_handshaking": {
            "max": 61.432709,
            "p(90)": 56.5201324,
            "p(95)": 59.077785649999996,
            "avg": 19.433610349999995,
            "min": 0,
            "med": 1.4751555
        },
        "http_req_failed": {
            "passes": 0,
            "fails": 200,
            "value": 0
        },
        "data_sent": {
            "count": 191932,
            "rate": 18754.077165269195
        },
        "http_req_connecting": {
            "avg": 3.078121825,
            "min": 0,
            "med": 0.0381215,
            "max": 30.159047,
            "p(90)": 2.3001576,
            "p(95)": 29.980106250000002
        },
        "http_req_receiving": {
            "avg": 0.08879654000000003,
            "min": 0.032965,
            "med": 0.074428,
            "max": 0.560174,
            "p(90)": 0.11370939999999999,
            "p(95)": 0.13344605
        },
        "http_req_duration{expected_response:true}": {
            "max": 10036.377609,
            "p(90)": 6262.5935644,
            "p(95)": 7269.28357115,
            "avg": 2314.446891585,
            "min": 12.700249,
            "med": 1333.138746
        },
        "http_req_blocked": {
            "avg": 23.81793637499999,
            "min": 0.000182,
            "med": 9.1834445,
            "max": 63.514034,
            "p(90)": 59.5801702,
            "p(95)": 60.9358394
        },
        "http_req_waiting": {
            "avg": 2314.2414409650005,
            "min": 12.528402,
            "med": 1332.9815374999998,
            "max": 10036.191374,
            "p(90)": 6262.4044401,
            "p(95)": 7269.13372385
        },
        "data_received": {
            "count": 639450,
            "rate": 62481.99697461281
        }
    },
    "root_group": {
        "checks": {
            "verify response code of POST is 201": {
                "passes": 200,
                "fails": 0,
                "name": "verify response code of POST is 201",
                "path": "::verify response code of POST is 201",
                "id": "8c3ca26510f8061c444b510eb133612e"
            }
        },
        "name": "",
        "path": "",
        "id": "d41d8cd98f00b204e9800998ecf8427e",
        "groups": {
            "teardown": {
                "name": "teardown",
                "path": "::teardown",
                "id": "a8a9942382e8ffe2e56ef29e664b8229",
                "groups": {},
                "checks": {}
            }
        }
    }
}